---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.RevisionSettings
source: html/1788f89c-6966-5e38-4e02-18f949d85271.htm
---
# RevisionSettings Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.